fn main() {
    let x = 2.0; // f64
    let y: f32 = 3.0; // f32

    println!("{:.17}", 0.1f64); // 输出：0.10000000000000001
    println!("{:.17}", 0.2f64); // 输出：0.20000000000000001
    println!("{:.17}", 0.1 + 0.2); // 输出：0.30000000000000004

    // 避免在浮点数上测试相等性
    // assert!(0.1 + 0.2 == 0.3);

    // 正确比较浮点数的方法。使用 允许误差（epsilon）比较
    // Rust 提供了 f32::abs_diff_eq() 或通过 float-cmp 等第三方 crate，也可以更优雅地处理
    let a = 0.1f64 + 0.2f64;
    let b = 0.3f64;
    let epsilon = 1e-10;

    assert!((a - b).abs() < epsilon); // 只要 a 和 b 的差距小于一个很小的值（误差范围内），就认为它们“相等”。


}
