use std::{thread, time::Duration};


/*
join 在英语中常见意思是：加入、连接、合并（e.g., "join a team", "join two strings"）
在多线程编程中，join 是一个术语，来源于 POSIX/C++/Java 等早期并发系统：让当前线程等待另一个子线程结束，然后再继续执行。

举个类比：
假设你和朋友分头去做事情，朋友说“等我做完，我们再一起走”。你就相当于“join”了他的计划，等他做完你再继续走。

举例：
Java: Thread.join()
C++: std::thread::join()
Rust: handle.join()
所以在 Rust 里，join 是继承了主流多线程语言的术语，语义其实不是“加入”，而是“合流等待”。


unwrap 英文原意就是：“剥开包装、打开、解开”（unwrap a gift 🎁）


| Rust 方法    | 原词义    | Rust 语义                               |
| ---------- | ------ | ------------------------------------- |
| `join()`   | 合流、加入  | 当前线程等待子线程执行完毕                         |
| `unwrap()` | 拆包装、打开 | 从 `Option`/`Result` 中取出值，如果是错误就 panic |

 */
fn main() {
    let handle = thread::spawn(|| {
        for i in 1..5 {
            println!("Spawned thread: {}", i);
            thread::sleep(Duration::from_millis(1));
        }
    });

    for i in 1..5 {
        println!("Main thread: {}", i);
        thread::sleep(Duration::from_millis(1));
    }

    handle.join().unwrap(); // 等待子线程结束
}
